АлогистикТест2/src/Reports/АктПередачиСырьяВПроизводство/АктПередачиСырьяВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АктПередачиСырьяВПроизводство</name>
  <comment>Удалить</comment>
  <attributes>
    <name>ЭтоОтчетУНФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

АлогистикТест2/src/InformationRegisters/алк_ОсновныеОбъекты/алк_ОсновныеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ОсновныеОбъекты</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидОбъекта</name>
    <type>
      <types>CatalogRef.алк_ВидыОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ГрадацииСечений/алк_ГрадацииСечений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ГрадацииСечений</name>
  <resources>
    <name>Градация</name>
    <type>
      <types>CatalogRef.Градации</types>
    </type>
  </resources>
  <dimensions>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_СборкаЗапасов/алк_СборкаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_СборкаЗапасов</name>
  <registerRecords>AccumulationRegister.алк_ВыпускПродукцииСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыКПоступлениюНаСкладыСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_МатериалыЗатратыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_УчетЛесопродукцииГОСТ</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыИсторияЗаказов</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <registerRecords>AccumulationRegister.алк_Отходы</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыпускОтходы</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПиломатериалыПереданныеНаСушку</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаЗапасов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаЗапасов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПродукции</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПродукции</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСборкаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ПропускатьМинусЗапасы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Автозаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРазделитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.алк_ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.алк_ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРазделитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаГОСТ</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоГОСТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемГОСТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомераПродукция</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отходы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.Ячейки</types>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Reports/АктПередачиСырьяВПроизводство/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиВариантов["АктПередачи"].Рекомендуемый = Истина;
	
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//Период = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	//Отпустил = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Отпустил")).Значение;
	//Получил = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Получил")).Значение;

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	Отпустил = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Отпустил")).Значение;
	Получил = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Получил")).Значение;
	
	//Проверим параметры периода
	Если НЕ Период.ДатаНачала = Дата(1,1,1)
		И НЕ Период.ДатаОкончания = Дата(1,1,1)
		И Период.ДатаНачала > Период.ДатаОкончания Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ru = 'Дата начала периода не должна превышать дату окончания.'");
		
		Возврат;
		
	КонецЕсли;
	
	Если Настройки.ПараметрыДанных.Элементы.Найти("ПараметрВарианта").Значение = "1" Тогда 
		ТабличныйДокумент = Сформировать(Период, Отпустил, Получил);
	ИначеЕсли Настройки.ПараметрыДанных.Элементы.Найти("ПараметрВарианта").Значение = "2" Тогда 
		ТабличныйДокумент = СформироватьПоДиаметрам(Период, Отпустил, Получил);
	Иначе
		ТабличныйДокумент = СформироватьПоДиаметрамБезСортов(Период, Отпустил, Получил);
	КонецЕсли;
	ДокументРезультат.Вывести(ТабличныйДокумент);
	ДокументРезультат.ФиксацияСверху = ТабличныйДокумент.ФиксацияСверху;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["АктПередачи"].Теги = НСТР("ru = 'Акт передачи'");
	
КонецПроцедуры

Процедура ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
	//ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["АктПередачи"].СвязанныеПоля, "Контрагент", "Справочник.Контрагенты");
	
КонецПроцедуры

Функция Сформировать(Период, Отпустил, Получил)
	
	Результат = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период.ДатаНачала));
	КонецПериода = ?(Период.ДатаОкончания = '3999-12-31' ИЛИ Период.ДатаОкончания = '0001-01-01', '0001-01-01', КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	
	//2018 06 27 есть регистр алк_МатериалыЗатратыВыпуска.
	//В нем недостаточно данных. Поэтому формируем по документам
	//Целесообразность регистра не очевидна.
	//Или отказаться от него и реализовать учет на регистре ЗапасыОрганизации.
	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Штабель КАК Штабель,
	|	ВложенныйЗапрос.Материал КАК Материал,
	|	ЕСТЬNULL(алк_ГрадацииСечений.Градация, ВложенныйЗапрос.Сечение) КАК Сечение,
	|	СУММА(ВложенныйЗапрос.Объем) КАК Объем,
	|	ВложенныйЗапрос.Сертификат КАК Сертификат
	|ИЗ
	|	(ВЫБРАТЬ
	|		алк_СборкаЗапасовЗапасы.Ссылка.ЯчейкаЗапасов КАК Штабель,
	|		ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Наименование, """") КАК Материал,
	|		алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	|		СУММА(алк_СборкаЗапасовЗапасы.Объем) КАК Объем,
	|		алк_СборкаЗапасовЗапасы.Сертификат КАК Сертификат
	|	ИЗ
	|		Документ.алк_СборкаЗапасов.Запасы КАК алк_СборкаЗапасовЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ПО алк_СборкаЗапасовЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ОсновныеОбъекты КАК алк_ОсновныеОбъекты
	|			ПО алк_СборкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаЗапасов = алк_ОсновныеОбъекты.Значение
	|				И (алк_ОсновныеОбъекты.ВидОбъекта = ЗНАЧЕНИЕ(Справочник.алк_ВидыОбъектов.УчастокСортированныхЛМ))
	|	ГДЕ
	|		алк_СборкаЗапасовЗапасы.Ссылка.Проведен
	|		И алк_СборкаЗапасовЗапасы.Ссылка.Дата >= &НачалоПериода
	|		И (алк_СборкаЗапасовЗапасы.Ссылка.Дата <= &КонецПериода
	|				ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		алк_СборкаЗапасовЗапасы.Ссылка.ЯчейкаЗапасов,
	|		алк_СборкаЗапасовЗапасы.Сертификат,
	|		алк_ПараметрыХарактеристик.Сечение,
	|		ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Наименование, """")) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрадацииСечений КАК алк_ГрадацииСечений
	|		ПО ВложенныйЗапрос.Сечение = алк_ГрадацииСечений.Сечение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Штабель,
	|	ВложенныйЗапрос.Материал,
	|	ВложенныйЗапрос.Сертификат,
	|	ЕСТЬNULL(алк_ГрадацииСечений.Градация, ВложенныйЗапрос.Сечение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Штабель,
	|	Материал,
	|	Сечение
	|ИТОГИ
	|	СУММА(Объем)
	|ПО
	|	Сертификат
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСертификат = Макет.ПолучитьОбласть("Сертификат");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	
	//ОбластьЗаголовок.Параметры.Валюта = Строка(ПараметрВалюта);
	//ОбластьЗаголовок.Параметры.Контрагент = Контрагент;
	//Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) И НЕ ЗначениеЗаполнено(КонецПериода) Тогда
	//	ОбластьЗаголовок.Параметры.Период = НСтр("ru = 'весь период работы'");
	//Иначе
	//	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода(Период.ДатаНачала, КонецПериода);
	//КонецЕсли; 
	
	
	ОбластьЗаголовок.Параметры.Номер = Формат(Период.ДатаНачала,"ДФ=dMM");
	ОбластьЗаголовок.Параметры.Дата = Формат(КонецПериода,"ДФ='dd MMMM yyyy'");
	
	Результат.Вывести(ОбластьЗаголовок);
	
	Результат.Вывести(ОбластьШапка);
	
	нпп = 0;
	
	ОбщиеИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОбщиеИтоги.Следующий();
	стр = ОбщиеИтоги.Выбрать();
	Пока стр.Следующий() Цикл
		нпп = нпп + 1;
		ОбластьСтрока.Параметры.Заполнить(стр);
		ОбластьСтрока.Параметры.нпп = нпп;
		Результат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьСертификат.Параметры.Заполнить(ОбщиеИтоги);
	
	Сертификат = "" + ОбщиеИтоги.Сертификат;
		
	Если Найти(Сертификат, "controlled") Тогда
		Сертификат = "PEFC controlled sources";		
	ИначеЕсли Найти(Сертификат, "PEFC") Тогда
		Сертификат = "100% " + Сертификат;	
	КонецЕсли; 
	
	ОбластьСертификат.Параметры.Сертификат = Сертификат;
	
	Результат.Вывести(ОбластьСертификат);
	
	ОбластьПодвал.Параметры.Заполнить(ОбщиеИтоги);
	Результат.Вывести(ОбластьПодвал);

	ОбластьПодписи.Параметры.ОтпустилДолжность = Отпустил.Должность;
	ОбластьПодписи.Параметры.ОтпустилФИО = Отпустил.РасшифровкаПодписи;
	ОбластьПодписи.Параметры.ПолучилДолжность = Получил.Должность;
	ОбластьПодписи.Параметры.ПолучилФИО = Получил.РасшифровкаПодписи;
	
	Результат.Вывести(ОбластьПодписи);
	
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьПоДиаметрам(Период, Отпустил, Получил)
	
	Результат = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период.ДатаНачала));
	КонецПериода = ?(Период.ДатаОкончания = '3999-12-31' ИЛИ Период.ДатаОкончания = '0001-01-01', '0001-01-01', КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	
	//2018 06 27 есть регистр алк_МатериалыЗатратыВыпуска.
	//В нем недостаточно данных. Поэтому формируем по документам
	//Целесообразность регистра не очевидна.
	//Или отказаться от него и реализовать учет на регистре ЗапасыОрганизации.
	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Штабель КАК Штабель,
	|	ВложенныйЗапрос.Материал КАК Материал,
	|	ВложенныйЗапрос.Сечение КАК Сечение,
	|	СУММА(ВложенныйЗапрос.Объем) КАК Объем,
	|	ВложенныйЗапрос.Сертификат КАК Сертификат
	|ИЗ
	|	(ВЫБРАТЬ
	|		алк_СборкаЗапасовЗапасы.Ссылка.ЯчейкаЗапасов КАК Штабель,
	|		ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Наименование, """") КАК Материал,
	|		алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	|		СУММА(алк_СборкаЗапасовЗапасы.Объем) КАК Объем,
	|		алк_СборкаЗапасовЗапасы.Сертификат КАК Сертификат
	|	ИЗ
	|		Документ.алк_СборкаЗапасов.Запасы КАК алк_СборкаЗапасовЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ПО алк_СборкаЗапасовЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ОсновныеОбъекты КАК алк_ОсновныеОбъекты
	|			ПО алк_СборкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаЗапасов = алк_ОсновныеОбъекты.Значение
	|				И (алк_ОсновныеОбъекты.ВидОбъекта = ЗНАЧЕНИЕ(Справочник.алк_ВидыОбъектов.УчастокСортированныхЛМ))
	|	ГДЕ
	|		алк_СборкаЗапасовЗапасы.Ссылка.Проведен
	|		И алк_СборкаЗапасовЗапасы.Ссылка.Дата >= &НачалоПериода
	|		И (алк_СборкаЗапасовЗапасы.Ссылка.Дата <= &КонецПериода
	|				ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		алк_СборкаЗапасовЗапасы.Ссылка.ЯчейкаЗапасов,
	|		алк_СборкаЗапасовЗапасы.Сертификат,
	|		алк_ПараметрыХарактеристик.Сечение,
	|		ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Наименование, """")) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Штабель,
	|	ВложенныйЗапрос.Материал,
	|	ВложенныйЗапрос.Сертификат,
	|	ВложенныйЗапрос.Сечение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Штабель,
	|	Материал,
	|	ВложенныйЗапрос.Сечение.ДиаметрММ
	|ИТОГИ
	|	СУММА(Объем)
	|ПО
	|	Сертификат
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСертификат = Макет.ПолучитьОбласть("Сертификат");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	
	//ОбластьЗаголовок.Параметры.Валюта = Строка(ПараметрВалюта);
	//ОбластьЗаголовок.Параметры.Контрагент = Контрагент;
	//Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) И НЕ ЗначениеЗаполнено(КонецПериода) Тогда
	//	ОбластьЗаголовок.Параметры.Период = НСтр("ru = 'весь период работы'");
	//Иначе
	//	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода(Период.ДатаНачала, КонецПериода);
	//КонецЕсли; 
	
	
	ОбластьЗаголовок.Параметры.Номер = Формат(Период.ДатаНачала,"ДФ=dMM");
	ОбластьЗаголовок.Параметры.Дата = Формат(КонецПериода,"ДФ='dd MMMM yyyy'");
	
	Результат.Вывести(ОбластьЗаголовок);
	
	Результат.Вывести(ОбластьШапка);
	
	нпп = 0;
	
	ОбщиеИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОбщиеИтоги.Следующий();
	стр = ОбщиеИтоги.Выбрать();
	Пока стр.Следующий() Цикл
		нпп = нпп + 1;
		ОбластьСтрока.Параметры.Заполнить(стр);
		ОбластьСтрока.Параметры.нпп = нпп;
		Результат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьСертификат.Параметры.Заполнить(ОбщиеИтоги);
	
	Сертификат = "" + ОбщиеИтоги.Сертификат;
		
	Если Найти(Сертификат, "controlled") Тогда
		Сертификат = "PEFC controlled sources";		
	ИначеЕсли Найти(Сертификат, "PEFC") Тогда
		Сертификат = "100% " + Сертификат;	
	КонецЕсли; 
	
	ОбластьСертификат.Параметры.Сертификат = Сертификат;
	
	Результат.Вывести(ОбластьСертификат);
	
	ОбластьПодвал.Параметры.Заполнить(ОбщиеИтоги);
	Результат.Вывести(ОбластьПодвал);

	ОбластьПодписи.Параметры.ОтпустилДолжность = Отпустил.Должность;
	ОбластьПодписи.Параметры.ОтпустилФИО = Отпустил.РасшифровкаПодписи;
	ОбластьПодписи.Параметры.ПолучилДолжность = Получил.Должность;
	ОбластьПодписи.Параметры.ПолучилФИО = Получил.РасшифровкаПодписи;
	
	Результат.Вывести(ОбластьПодписи);
	
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьПоДиаметрамБезСортов(Период, Отпустил, Получил)
	
	Результат = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период.ДатаНачала));
	КонецПериода = ?(Период.ДатаОкончания = '3999-12-31' ИЛИ Период.ДатаОкончания = '0001-01-01', '0001-01-01', КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	
	//2018 06 27 есть регистр алк_МатериалыЗатратыВыпуска.
	//В нем недостаточно данных. Поэтому формируем по документам
	//Целесообразность регистра не очевидна.
	//Или отказаться от него и реализовать учет на регистре ЗапасыОрганизации.
	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Штабель КАК Штабель,
	|	ВложенныйЗапрос.Материал КАК Материал,
	|	ВложенныйЗапрос.Сечение КАК Сечение,
	|	СУММА(ВложенныйЗапрос.Объем) КАК Объем,
	|	ВложенныйЗапрос.Сертификат КАК Сертификат
	|ИЗ
	|	(ВЫБРАТЬ
	|		алк_СборкаЗапасовЗапасы.Ссылка.ЯчейкаЗапасов КАК Штабель,
	|		ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.Наименование, """") КАК Материал,
	|		алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	|		СУММА(алк_СборкаЗапасовЗапасы.Объем) КАК Объем,
	|		алк_СборкаЗапасовЗапасы.Сертификат КАК Сертификат
	|	ИЗ
	|		Документ.алк_СборкаЗапасов.Запасы КАК алк_СборкаЗапасовЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ПО алк_СборкаЗапасовЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ОсновныеОбъекты КАК алк_ОсновныеОбъекты
	|			ПО алк_СборкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаЗапасов = алк_ОсновныеОбъекты.Значение
	|				И (алк_ОсновныеОбъекты.ВидОбъекта = ЗНАЧЕНИЕ(Справочник.алк_ВидыОбъектов.УчастокСортированныхЛМ))
	|	ГДЕ
	|		алк_СборкаЗапасовЗапасы.Ссылка.Проведен
	|		И алк_СборкаЗапасовЗапасы.Ссылка.Дата >= &НачалоПериода
	|		И (алк_СборкаЗапасовЗапасы.Ссылка.Дата <= &КонецПериода
	|				ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		алк_СборкаЗапасовЗапасы.Ссылка.ЯчейкаЗапасов,
	|		алк_СборкаЗапасовЗапасы.Сертификат,
	|		алк_ПараметрыХарактеристик.Сечение,
	|		ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.Наименование, """")) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Штабель,
	|	ВложенныйЗапрос.Материал,
	|	ВложенныйЗапрос.Сертификат,
	|	ВложенныйЗапрос.Сечение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Штабель,
	|	Материал,
	|	ВложенныйЗапрос.Сечение.ДиаметрММ
	|ИТОГИ
	|	СУММА(Объем)
	|ПО
	|	Сертификат
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСертификат = Макет.ПолучитьОбласть("Сертификат");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	
	//ОбластьЗаголовок.Параметры.Валюта = Строка(ПараметрВалюта);
	//ОбластьЗаголовок.Параметры.Контрагент = Контрагент;
	//Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) И НЕ ЗначениеЗаполнено(КонецПериода) Тогда
	//	ОбластьЗаголовок.Параметры.Период = НСтр("ru = 'весь период работы'");
	//Иначе
	//	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода(Период.ДатаНачала, КонецПериода);
	//КонецЕсли; 
	
	
	ОбластьЗаголовок.Параметры.Номер = Формат(Период.ДатаНачала,"ДФ=dMM");
	ОбластьЗаголовок.Параметры.Дата = Формат(КонецПериода,"ДФ='dd MMMM yyyy'");
	
	Результат.Вывести(ОбластьЗаголовок);
	
	Результат.Вывести(ОбластьШапка);
	
	нпп = 0;
	
	ОбщиеИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОбщиеИтоги.Следующий();
	стр = ОбщиеИтоги.Выбрать();
	Пока стр.Следующий() Цикл
		нпп = нпп + 1;
		ОбластьСтрока.Параметры.Заполнить(стр);
		ОбластьСтрока.Параметры.нпп = нпп;
		Результат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьСертификат.Параметры.Заполнить(ОбщиеИтоги);
	
	Сертификат = "" + ОбщиеИтоги.Сертификат;
		
	Если Найти(Сертификат, "controlled") Тогда
		Сертификат = "PEFC controlled sources";		
	ИначеЕсли Найти(Сертификат, "PEFC") Тогда
		Сертификат = "100% " + Сертификат;	
	КонецЕсли; 
	
	ОбластьСертификат.Параметры.Сертификат = Сертификат;
	
	Результат.Вывести(ОбластьСертификат);
	
	ОбластьПодвал.Параметры.Заполнить(ОбщиеИтоги);
	Результат.Вывести(ОбластьПодвал);

	ОбластьПодписи.Параметры.ОтпустилДолжность = Отпустил.Должность;
	ОбластьПодписи.Параметры.ОтпустилФИО = Отпустил.РасшифровкаПодписи;
	ОбластьПодписи.Параметры.ПолучилДолжность = Получил.Должность;
	ОбластьПодписи.Параметры.ПолучилФИО = Получил.РасшифровкаПодписи;
	
	Результат.Вывести(ОбластьПодписи);
	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

ЭтоОтчетУНФ = Истина;

#КонецЕсли
